# Microsoft-Movie-Analysis

**Author:** Prudence Coredo

**dsc-06-FT**
***

## Overview

A one-paragraph overview of the project, including the business problem, data, methods, results and recommendations.

Microsoft have decided to create a new movie studio and require more insight into which types of films are doing best at the box office in order to choose the genre of movies to produce that can generate the most profit.
This project uses descriptive statistical analysis on data gathered from [IMDb website](https://www.imdb.com/) to gain insight into which combination of genres topped the league in these areas.

### Business Understanding

Summary of the business problem you are trying to solve, and the data questions that you plan to answer to solve them.


Questions to consider:
* What are the business's pain points related to this project?
* How did you pick the data analysis question(s) that you did?
* Why are these questions important from a business perspective?
***

Microsoft wants to create a new movie studio, they want to know which types of movies are the most successful. To answer that question both Domestic and Foreign Sales data was analysed to see the most financially successful genres, along with the average rating given and number of votes for each type or genre of movie to see how popularity compared with financial success.

## Data Understanding

Describe the data being used for this project.
***
Questions to consider:
* Where did the data come from, and how do they relate to the data analysis questions?
* What do the data represent? Who is in the sample and what variables are included?
* What is the target variable?
* What are the properties of the variables you intend to use?
***

### Importing the libraries

In [3]:
# Import standard packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

#### Loading the dataset

In [4]:
#load the first csv file 
movie_gross = pd.read_csv('bom.movie_gross.csv')
df1 = pd.read_csv('tmdb.movies.csv')

#### Previewing the dataset

We need to be able to see what kind of data we are dealing with to better understand what's relevant in the dataset before analysis.

In [5]:
#viewing the top of the dataset
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [6]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [36]:
movie_gross.shape

(3387, 5)

In [7]:
#checking number of entries in each column
movie_gross.count()

title             3387
studio            3382
domestic_gross    3359
foreign_gross     2037
year              3387
dtype: int64

In [8]:
#Changing the data type of the column year from int to datetime.
movie_gross['year'] =  pd.to_datetime(movie_gross['year'])
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 132.4+ KB

In [9]:
type(movie_gross)
movie_gross.describe()

       domestic_gross
count    3.359000e+03
mean     2.874585e+07
std      6.698250e+07
min      1.000000e+02
25%      1.200000e+05
50%      1.400000e+06
75%      2.790000e+07
max      9.367000e+08

In [10]:
movie_gross['studio'].value_counts()

IFC           166
Uni.          147
WB            140
Fox           136
Magn.         136
             ...
CLF             1
GrtIndia        1
KC              1
Synergetic      1
Arrow           1
Name: studio, Length: 257, dtype: int64

 Now that we have viewed the first dataset, We can now look at the database data to get an insight of how to relate the different tables

In [11]:
#importing the sql database which is our main dataset
import sqlite3
conn = sqlite3.connect("im.db")

In [12]:
#Viewing tables in the database
data = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)
data

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [33]:
#Loading the data from the table movie_basics
pd.read_sql("""SELECT * FROM movie_basics;""", conn)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [14]:
pd.read_sql("""SELECT * FROM movie_basics;""", conn).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [15]:
pd.read_sql("""SELECT * FROM movie_basics;""", conn)['genres'].unique()

array(['Action,Crime,Drama', 'Biography,Drama', 'Drama', ...,
       'Music,Musical,Reality-TV', 'Animation,Crime',
       'Adventure,History,War'], dtype=object)

In [16]:
pd.read_sql("""SELECT * FROM movie_basics;""", conn)['genres'].value_counts()

Documentary                     32185
Drama                           21486
Comedy                           9177
Horror                           4372
Comedy,Drama                     3519
                                ...
Action,Family,Mystery               1
Comedy,Fantasy,Sport                1
Animation,Documentary,Horror        1
Crime,Family,Horror                 1
Animation,Biography,Fantasy         1
Name: genres, Length: 1085, dtype: int64

In [17]:
#Loading the contents from the table movie_ratings.
pd.read_sql("""SELECT * FROM movie_ratings;""", conn)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [46]:
pd.read_sql("""SELECT * FROM movie_ratings;""", conn).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

## Data Preparation

Describe and justify the process for preparing the data for analysis.

***
Questions to consider:
* Were there variables you dropped or created?
* How did you address missing values or outliers?
* Why are these choices appropriate given the data and the business problem?
***

### Cleaning the data
We need to check for  duplicates, missing and duplicate values, null values before we can merge or query the data to produce graphs

movie_basics

In [19]:
#Checking whether there are any null values in any column in the table movie_basics
non = pd.read_sql(""" 
SELECT *
FROM movie_basics;""",conn)
non.isnull().sum()

movie_id               0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [52]:
#Changing the data type
non['start_year'] = pd.to_datetime(non['start_year'])
#non.info()

The column original_title, runtime_minutes and genres have missing values. Depending on their importance we may drop the rows that contain the values or drop the whole column instead.

In [30]:
#Checking for duplicates
non.duplicated().sum()

0

There are no null values or duplicates in the movie_ratings table

movie_gross

In [27]:
#Checking for null values in movie_gross data
movie_gross.isnull().values.any()

True

In [21]:
movie_gross.isnull().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [29]:
movie_gross.duplicated().sum()

0

In [53]:
#checking the data types
#Changing the data type of the column year from int to datetime.
movie_gross['year'] =  pd.to_datetime(movie_gross['year'])
#movie_gross['foreign_gross'] = movie_gross['foreign_gross'].astype(int)
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 132.4+ KB

In [22]:
# Import the visualization package you created

#import code.visualizations as viz

In [23]:
# This example function takes no arguments currently, but you would pass the full dataset to it for your project

#viz.sample_plot_1()

In [24]:
# here you run your code to clean the data
#import code.data_cleaning as dc

#full_dataset = dc.full_clean()

# Exploratory Data Analysis (EDA)

 ### Univariate Analysis

IT gives us the charesteristics or behaviour of an individual variable.

# Data Modeling
Describe and justify the process for analyzing or modeling the data.

***
Questions to consider:
* How did you analyze or model the data?
* How did you iterate on your initial approach to make it better?
* Why are these choices appropriate given the data and the business problem?
***

In [25]:
# here you run your code to model the data

## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?
***

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

***
Questions to consider:
* What would you recommend the business do as a result of this work?
* What are some reasons why your analysis might not fully solve the business problem?
* What else could you do in the future to improve this project?
***